Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K10.tmx
Source language: en_us
Languages: zh_cn

source: The Invitation
zh_cn: 请来参加我的婚礼

source: By the time my father reappeared in my life, I hadn't seen him in nearly ten years.
zh_cn: 父亲再次出现在我的生活里时，我已经将近十年没有见过他了。

source: My mother came home from her job as a hospital nurse one day and said, "I think you should invite your father to the wedding."
zh_cn: 有一天，在医院做护士的妈妈下班回来后对我说：“我觉得你应该请你的父亲来参加婚礼。”

source: "Who?" I asked.
zh_cn: “谁？”我问道。

source: "Your father."
zh_cn: “你的父亲。”

source: I put down the platano en tentaci¨®n I'd been snacking on.
zh_cn: 我放下手中当零食吃的一大碟焗香蕉。

source: Outside, across the street, our neighbor's dog barked at the cars as they zoomed up and down the street.
zh_cn: 街对面，过路车隆隆开过，引得邻居家的狗叫个不停。

source: My mother kicked off her white nurse shoes and unbuttoned the top of her uniform.
zh_cn: 妈妈踢掉脚上的白色护士鞋，解开护士服上的扣子。

source: "I know," she said. "But I've been thinking about it. And today I decided he should come."
zh_cn: “我明白你的心情，”她说：“可我已经想了一阵子，今天拿定了主意，他应该来。”

source: "What happened today?"
zh_cn: “今天出什么事了？”

source: She swiped a slice of platano from my plate and popped it in her mouth.
zh_cn: 她从我的盘子上拿了一块香蕉，塞进自己口中。

source: "You use too much salt," she said, making a face.
zh_cn: “盐放得太多啦。”她边说边做出一脸苦相。

source: "Mami, did something happen today at work?"
zh_cn: “妈妈，今天上班的时候出什么事了吗？”

source: My mother had a habit of making big decisions about her life on the days when a patient passed away at the hospital, whether in my mother's presence or not.
zh_cn: 妈妈有个习惯：每次医院里有病人死去，不管是不是当着她面发生的，她就会在那天做出自己生活中的大决定。

source: Last month, after a thirty-four-year-old man died of a heart attack, she swore off red meat.
zh_cn: 上个月，一个34岁的男子死于心脏病，她在那天发誓不再吃红肉。

source: "Someone was sick," my mother said. "A father who hadn't talked to his family in a long time. I thought he was another good-for-nothing like the rest of them. But it was very sad."
zh_cn: “有个病人，”妈妈说：“也是个很久没有和家人联系的父亲，我看他也不过是个没用的东西，和其他那些抛下家人的父亲们没什么两样，可这让人很伤感。”

source: "It made you think of Papi."
zh_cn: “让你想起爸爸了？”

source: "It would be nice if you invited him."
zh_cn: “你如果请他来的话，那是件好事。”

source: My mother made arrangements for us to meet.
zh_cn: 妈妈安排我们见面。

source: Tuesday. Restaurante Boulevard. Six o'clock.
zh_cn: 星期二，布尔瓦餐厅，六点钟。

source: The restaurant was three blocks from my office, so I walked there in the heavy, damp air, thinking about the last time I had seen my father.
zh_cn: 餐厅离我上班的地方只隔三个街区，我走了过去。天气沉闷潮湿，我边走边想着最后一次见到父亲的情形。

source: I was fourteen, and he had volunteered to walk me to school in the morning - a rare occurrence - so I knew something was fishy.
zh_cn: 我当时14岁，他主动提出要陪我走着去上学—这可是件稀罕事—于是我明白有什么事不对劲了。

source: I just didn't know that after he dropped me off, he was going to keep on walking right out of my life.
zh_cn: 不过我不知道的是，就在他把我留在学校门口之后，他会一直走下去，干脆走出了我的生活。

source: He didn't come home that night or the next, and finally my mother admitted that he was staying at a friend's house.
zh_cn: 那晚他没有回家，之后的晚上也没有。最后妈妈告诉我他借宿在朋友家。

source: A while later, she reported that he was staying at a hotel, and still later, that he had moved to a different town.
zh_cn: 过了一阵子，她又告诉我他搬去酒店了，再然后，他搬去另一个城市了。

source: My mother assured me again and again that it wasn't my fault, that she and my father had their own insurmountable problems.
zh_cn: 妈妈一次次地向我保证这不是我的错，是她和父亲之间存在着无法解决的问题。

source: I didn't care what she said.
zh_cn: 我毫不在意妈妈的这些话。

source: I steeled myself against thoughts of my father.
zh_cn: 我把和父亲有关的想法都束之高阁。

source: I talked myself into not caring about him one way or another. I talked myself into believing that he was nothing to me.
zh_cn: 我说服自己无论从哪个方面都不要去在意他，也迫使自己相信父亲对我而言并不重要。

source: And, anyway, life had gone on.
zh_cn: 总之，生活继续着。

source: I finished my schooling, had boyfriends and broken hearts, traveled, fought with my mother, fought with best friends, made up with my mother, made up with best friends, graduated from college, had gotten a job as a teller at Banco Continental, and met the man I was going to marry.
zh_cn: 我上完了学，交了几个男朋友，伤过几次心，四处旅行，和妈妈争执，和最要好的朋友闹翻，与妈妈和好，同朋友也言归于好，大学毕业，在大陆银行找到了这份出纳的工作，遇到了我将要嫁的这个男人。

source: Would my life have been different with my father? Probably.
zh_cn: 如果父亲没有离开，我的生活会有什么不同吗?也许会吧。

source: Would it have been much different? Probably not.
zh_cn: 但会有很大的区别吗？应该不会。

source: So that was that.
zh_cn: 事情就是这么简单。

source: As soon as I walked in the restaurant, I saw him sitting by himself at a table, twirling an unlit cigarette through his fingers like a miniature baton.
zh_cn: 一走进餐厅，我就看到他一个人坐在桌边，手里转动着一只没有点燃的香烟，好像在把玩一只小型警棍。

source: He stopped for a second and raised the cigarette to his nose, sniffing it.
zh_cn: 他停了一下 ，将香烟凑到鼻头，闻了闻。

source: He looked up as I approached. "Monica?"
zh_cn: 抬起头时，他看到我走了过来：“莫妮卡？”

source: I nodded.
zh_cn: 我点了点头。

source: "Oh my God," he said.
zh_cn: “我的上帝，”他说道。

source: His voice was small and thin, and up close, he looked old - much older than my mother - although I didn't know what I had expected.
zh_cn: 他的声音又细又低，我近前打量他：他老了，比妈妈看上去要老得多，尽管我也不知道自己希望看到怎样的一个父亲。

source: I took a seat.
zh_cn: 我坐了下来。

source: Without a word, he slid me a menu and stuck the cigarette behind his ear.
zh_cn: 他没说话，只是把菜单从桌面上滑过来，将香烟夹在耳朵后。

source: When I'd finished scanning the menu, he asked, "Do you remember me?"
zh_cn: 我草草看完菜单之后，他问道：“你还记得我吗？”

source: "Of course."
zh_cn: “当然记得。”

source: He smiled, relieved. "Good. Yes, that's good."
zh_cn: 他笑了，松了一口气：“这就好，真的，这太好了。”

source: We said nothing more until the waitress took our orders - a mozzarella and salchichones sandwich for me, a salad for my father.
zh_cn: 我们都没再说什么，女招待为我们点了餐，我要的是意大利干酪和香肠三文治，他点了一份沙拉。

source: In a manner as inconspicuous as possible, I studied his face, his pockmarked cheeks, the skin sagging at his neck, trying to fit the current version of him with the face I remembered.
zh_cn: 我仔细打量着父亲，尽可能小心不被他注意到。他的面颊上长着痘痘，脖子上的皮松松地堆了下来，我努力地把这张脸和记忆中的那张拼在一起。

source: "Tell me something," he said when the waitress left. "Tell me about yourself."
zh_cn: “和我聊聊吧，”女招待走开后，他说：“聊聊你自己。”

source: "I work at Banco Continental now," I said. When he didn't respond, I added, "As a teller.
zh_cn: “我在大陆银行工作，”我说，他没说话，我补了一句：“做出纳。

source: I graduated from the University of Panama in finance."
zh_cn: 我是巴拿马大学金融系毕业的。”

source: "You've grown into a beautiful girl," my father said.
zh_cn: “你出落成漂亮的大姑娘了。”父亲说。

source: Self-consciously I ran a hand over my ponytail.
zh_cn: 我有些不自在地用手摸了摸自己的马尾巴。

source: When I caught his gaze, my father was looking at me with a paternal glow, his mouth set in a wide smile.
zh_cn: 我看到父亲盯着我看，张着嘴巴微笑着，脸上闪烁着为人父母的骄傲。

source: After a few seconds, he coughed and folded his olive-skin hands on the table.
zh_cn: 过了一会，他咳嗽了几声，把橄榄色的双手合拢在桌面上。

source: "And you're getting married?"
zh_cn: “你就要嫁人啦？”

source: "In a month."
zh_cn: “还有一个月。”

source: "That's what your mother told me.
zh_cn: “你妈妈也是这么说的。

source: I never thought she'd speak a word to me again.
zh_cn: 我可真是没想到她还肯和我说话。

source: She was - " he drew pinched fingers across his pinched lips, "with me.
zh_cn: 她...”他用瘦瘦的手指摸了摸苍白的嘴唇：“碰到我。

source: And then she told me you were getting married. 'Monica is to wed,' she said. So formal. Like she had prepared a script to be able to talk to me."
zh_cn: 告诉我你就要出嫁了。‘莫妮卡要结婚了，’她说得非常正式，好像打好了草稿才来和我说话的。”

source: He glanced at his hands, turning his thumbs over each other. "And the guy? What's his name?"
zh_cn: 他看了看自己的手，两个大拇指对着：“小伙子怎么样？叫什么名字？”

source: I told him about Cesar, whom I had met in my last year at university and who had studied business and now worked for Adidas.
zh_cn: 我告诉他塞萨尔的情况。我在大学的最后一年里认识他，他是商学院的学生，现在在阿迪达斯工作。

source: I told him that Cesar and I had put a down payment on a house in Las Cumbres. "It has a maid's room," I said, "but we probably won't hire a maid until we have children."
zh_cn: 我告诉他我和塞萨尔已经给拉斯昆布雷拉斯的一所房子付了订金，“有佣人房，”我说：“不过我们多半不会请人，除非是有了孩子。”

source: "Children?" my father asked.
zh_cn: “准备要孩子吗？”父亲问道。

source: "Maybe."
zh_cn: “也许要吧。”

source: After the waitress arrived with our food, we ate in silence for a time.
zh_cn: 女招待端来了我们的晚餐，我们默默地吃了一会儿。

source: Being there with my father felt easy, easier than I had anticipated, and the knowledge that it was easy was almost stranger than the encounter itself.
zh_cn: 和父亲相处很自在，比我想象的要轻松得多。我会觉得自在，这可能比我们见面这件事还更让我觉得出乎意料。

source: Around his plate my father lined up the tomato wedges from his salad like a scalloped necklace.
zh_cn: 父亲把沙拉里的西红柿块顺着自己的碟子排了一圈，好像一圈锯齿项链。

source: "Do you still like tomatoes?" he asked.
zh_cn: “你还是喜欢西红柿吗？”

source: "I like tomato sauce," I offered. "On spaghetti."
zh_cn: “我喜欢西红柿酱，”我说：“拌意粉吃。”

source: "You used to like tomatoes.
zh_cn: “你以前喜欢西红柿。

source: Do you remember the time we were in that little market?
zh_cn: 还记得我们去小菜场的那次吗？

source: We were buying yam for your mother. I was picking some out, and when I turned around you were eating a tomato.It was all over your face. The seeds. Everything."
zh_cn: 我们去为你妈妈买山药，我正挑着呐，回头就看到你在吃西红柿，吃得满脸都是。西红柿籽啦，到处都是。”

source: I didn't remember, but I didn't want to disappoint him by saying so. "What do you do now?" I asked.
zh_cn: 我不记得了，可不想直说，免得他觉得失望，“你现在做什么呢？”我问。

source: "For work? I repair shoes. You don't remember? I was a shoe salesman when you were younger."
zh_cn: “你是说工作？我修鞋的，你不记得了？你小时候我是个卖皮鞋的。”

source: "I remember. At that shop by the Super 99."
zh_cn: “记得，就在超级99旁边的那家店里。”

source: "Correct," my father said. "A whole life spent in shoes."
zh_cn: “对，”父亲说：“一辈子都花在鞋上了。”

source: He craned his body to glimpse under the table. "Your shoes are nice," he said, and then coughed.
zh_cn: 他俯下身来，看了看桌底，“你穿了一双好鞋，”他说，又开始咳嗽。

source: They were plain pumps.
zh_cn: 我穿着普通的轻便鞋。

source: "Thanks," I said. "They're just my work shoes."
zh_cn: “谢谢，”我说：“这不过是我的工作鞋。”

source: We kept eating, my father digging at every flake of lettuce while assiduously avoiding the tomatoes.
zh_cn: 我们接着吃了起来，父亲挑着吃一片片生菜叶子，却仔仔细细地避开西红柿块。

source: I finished my sandwich, and the waitress cleared our plates.
zh_cn: 我吃完了自己的三文治，女招待收走了桌上的餐碟。

source: Without our meals in front us, I was at a loss, so I reached into my purse and pulled out the invitation, setting it on the table.
zh_cn: 面前没有了食物，我有点不知所措，于是伸手从皮包里拿出请柬，把它立在桌上。

source: It was simple - black lettering on cream-colored paper.
zh_cn: 请柬很简单，奶油色纸上印着黑色的字。

source: On the envelope, my mother had written Sr. Jos¨¦ Bonilla, E(n) S(us) M(anos).
zh_cn: 妈妈在信封上写了何塞·博尼利亚先生。

source: My father stared at it without touching it. "Should I open it now?" he asked.
zh_cn: 爸爸看着请柬，没有拿起它，“我该现在打开看吗？”他问。

source: "If you want to."
zh_cn: “如果你愿意的话。”

source: I slid my hands under my thighs and watched as he read it, tracing each line with his finger.
zh_cn: 我把手塞在大腿下面，观察着正在看请柬的父亲，他用指头一行行边指着边看。

source: After he finished, he asked, "Who will walk you down the aisle?"
zh_cn: 看完后，他问：“那婚礼时谁来挽着你走向新郎呢？”

source: "What?"
zh_cn: “什么？”

source: "Cesar's father?"
zh_cn: “塞萨尔的父亲吗？”

source: "Actually, I hadn't thought about it."
zh_cn: “其实，我还没想这件事。”

source: "What's his name? Cesar's father?"
zh_cn: “他叫什么名字？塞萨尔的父亲？”

source: "Do you want to do it?" I asked.
zh_cn: “你想陪着我走过去吗？”

source: One look at him told me he did but that he couldn't bring himself to ask.
zh_cn: 我一眼就看出来他想这么做，但又无法主动开口。

source: "You should do it," I said.
zh_cn: “你应该的。”

source: "I don't think it would be right."
zh_cn: “我觉得这样做好像不太对。”

source: "It wouldn't be wrong."
zh_cn: “可也没什么错啊。”

source: "You wouldn't mind?"
zh_cn: “你不介意吗？”

source: "You should do it." My father gazed at me for a long time, a kind of sorrow pooled in his eyes.
zh_cn: “这就是父亲该做的。” 父亲长时间地盯着我，眼里泛起层层忧伤。

source: "So I will see you ..." he finally said, and consulted the invitation.
zh_cn: 最后他开口了：“那我们...”

source: "On Saturday, September 20."
zh_cn: 看了一眼请柬：“九月二十号，星期六见。”

source: My mother was sitting on the patio, drinking tonic water when I got home.
zh_cn: 回到家的时候，妈妈坐在露台上，喝着汤力水。

source: There was a time I could have come home and found her drinking Ron Abuelo and Coke, but ever since a woman at the hospital passed away during a liver transplant, she'd sworn off alcohol.
zh_cn: 有一阵子，我回家后会撞到她在喝加了可乐的朗姆酒。不过自从医院里有个女人在肝移植手术中去世，妈妈就发誓不再喝酒了。

source: "So how did everything go?" she asked when she saw me.
zh_cn: “一切顺利吗？”看到我之后，她问道。

source: "Were you waiting for me?"
zh_cn: “你在等我？”

source: "Did you have a good time?"
zh_cn: “你们在一起开心吗？”

source: "Actually, I did."
zh_cn: “说实话，我觉得还行。”

source: My mother nodded. "So, what else?"
zh_cn: 妈妈点点头：“那还有什么？”

source: "We decided he would walk me down the aisle."
zh_cn: “我们商量好了，他会挽着我走过去。”

source: I expected her to be angry.
zh_cn: 我以为她会生气。

source: I expected her to say something about how coming to the wedding was one thing, but how he didn't deserve to walk me down the aisle like a proper father.
zh_cn: 我等着她和我说，参加婚礼是一回事，可他不配像个真正的父亲一样挽着我走向新郎。

source: I was bracing myself for it when she said, "I hope you agreed to it. That would be nice for him."
zh_cn: “我希望你答应他了，这对他是件好事。”

source: She took another sip of her fizzy water.
zh_cn: 她这样说的时候，我刚做好准备要说服她。

source: "So," I said. "You understand this means that he's actually going to come, right? Will you be okay?"
zh_cn: “那么，”我说：“你明白，这就意味着他真的会出现，对吧？你真的没事吗？”

source: "I'll be fine," she said. "Me? I will be just fine."
zh_cn: “我没问题，”她说：“我？我一点问题都没有。”

source: When my father showed up the day of the wedding, it was the first time I had seen him since our reunion at Boulevard.
zh_cn: 布尔瓦餐厅和父亲重聚之后，我们就没有再见过面。婚礼那天，我才又一次见到他。

source: I was sitting in a limousine with tinted windows - just me and the driver - watching the guests file into the church.
zh_cn: 我坐在豪华轿车里，只有我和司机。隔着染过色的车窗玻璃，我看着客人们排队进入教堂。

source: My father rounded the corner, wearing a tuxedo with tails and a bow tie and carrying a large white box.
zh_cn: 父亲转过街角，穿着带后襟的燕尾服，蝴蝶结领结，拿着一个大大的白色纸盒。

source: He put the box on the ground at the foot of the stone steps and idled by it while he shook out his pants legs.
zh_cn: 他把纸盒放在石阶底部的地上，自己在旁边走来走去，抖了抖裤腿。

source: I watched him sit on a step to tighten the laces on his dress shoes.
zh_cn: 我看着他坐在石阶上，系紧礼服鞋的鞋带。

source: He slid his hand in his pocket and produced a cigarette. He stared at it balanced in his open palm for a few seconds and then slipped it back into his pocket.
zh_cn: 他伸手从口袋里掏出一只烟来，把烟放在摊开的手掌上看了一会，又放回口袋。

source: People walked by him and glanced at the box, but he seemed not to notice.
zh_cn: 人们从他身边走过，都会看两眼那个白色纸盒子，他却好像没有注意到。

source: I saw my mother peek out the church door and, upon identifying him, rush down the steps.
zh_cn: 我看到妈妈从教堂的门口探头往外看，看到父亲之后，她快步走下石阶。

source: They greeted each other stiffly, without affection.
zh_cn: 他们生硬地打着招呼，没有一丝爱意。

source: My mother gestured toward the box and at one point threw up her arms in what I recognized as disbelief.
zh_cn: 妈妈指着纸盒，有一霎那，她举起了双手，这个手势在我看来是难以置信的意思。

source: Then my father carried the box back to the parking lot, while my mother stood shaking her head.
zh_cn: 然后父亲把纸盒拿回了停车场，妈妈站在原地摇着头。

source: The driver said if I was cold he could turn the air down.
zh_cn: 司机说如果我觉得冷，他可以关掉空调。

source: I told him I was fine.
zh_cn: 我告诉他我很好。

source: And I was.
zh_cn: 我确实很好。

source: I felt remarkably calm.
zh_cn: 我出奇地平静。

source: Cesar and I had been together for two years. I loved him completely.
zh_cn: 我和塞萨尔在一起两年了，我毫无保留地爱着他。

source: Everything I did was better when he was around.
zh_cn: 无论做什么，有他在身边，我都可以做得更好。

source: I had no doubts.
zh_cn: 我的心中没有丝毫疑惑。

source: I lowered the mirror and checked my face.
zh_cn: 我把镜子拉下来，照了照我的脸。

source: My hair was in ringlets piled at the crown of my head.
zh_cn: 头发一卷卷地盘在头顶。

source: I bared my teeth to make sure there was nothing in them.
zh_cn: 我露出牙齿，看清楚牙齿上没有东西。

source: When I looked out the window again, my mother was standing at the top of the church steps beckoning my father, who was empty-handed now, to come inside.
zh_cn: 我再往车窗外看的时候，妈妈站在教堂石阶顶上，在对父亲招手，让他进去。现在的父亲手里什么也没拿。

source: Not more than a minute after he disappeared through the huge wooden doors, my mother came flurrying down the steps and opened the limousine door.
zh_cn: 他消失在教堂大大的木门后还没过一分钟，妈妈就飞奔下台阶，打开车门。

source: "It's time," she said.
zh_cn: “到时间了。”她说。

source: I nodded, gathering my dress and stepping gingerly onto the sidewalk.
zh_cn: 我点了点头，把婚纱拢在一起，小心翼翼地下到人行道上。

source: The sun was radiant, the air humid.
zh_cn: 阳光灿烂，天气潮湿。

source: My mother reached into the limo for my bouquet and handed it to me.
zh_cn: 妈妈从车里拿出我的新娘捧花，递给我。

source: "When you walk in, your father will be there.
zh_cn: “进去之后，你父亲会在那里等你。

source: You just link arms, and on the fourth beat of the music, you start walking.
zh_cn: 你挽着他，在音乐的第四拍开始朝前走。

source: Don't walk too fast.
zh_cn: 不要走太快。

source: You want to enjoy this.
zh_cn: 你会愿意享受这一刻的。

source: Smile at people as you pass them. If you feel wobbly, look to Cesar.
zh_cn: 边走边对两旁的客人们微笑，要是觉得紧张，就看着塞萨尔。
